app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("created_at", "descripcion", "fecha", "formato", "id_materia", "nombre", "peso", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)